#Задача 2.1(а)
print('Вычисление значения функции y=17x^2-6x+13')
x=float(input('Введите любое число для x:'))
y=17*x**2-6*x+13
print('Значение функции 17x^2-6x+13 при x =', x, 'равно:', y)
print()
#Задача 2.1(б)
print('Вычисление значения функции y=3a^2+5a-21')
a=float(input('Введите любое число для a:'))
y=3*a**2+5*a-21
print('Значение функции 3a^2+5a-21 при a =', a, 'равно:', y)
