#Задача 2.10
print('Найти среднее арифметическое и среднее геометрическое')
a=int(input('Введите первое число:'))
b=int(input('Введите второе число:'))
sa=(a+b)/2
sg=(a*b)**0.5
print('Их среднее арифметическое:', round(sa,2))
print('Их среднее геометрическое:', round(sg,2))
