#Задача 2.11
print('Найти плотность тела')
v=float(input('Введите объем:'))
m=float(input('Введите массу:'))
p=m/v
print('Плотность данного тела равна', round(p,2))
