#Задача 2.12
k=int(input('Введите количество жителей:'))
s=float(input('Введите площадь:'))
p=k/s
print('Плотность населения составляет', round(p,3))
