#Задача 2.14
print('Найти гипотенузу')
a=float(input('Введите первый катет:'))
b=float(input('Введите второй катет:'))
c=(a**2+b**2)**0.5
print('Гипотенуза равна', round(c,2))
