#Задача 2.16
print('Найти периметр')
a=float(input('Введите первый катет:'))
b=float(input('Введите второй катет:'))
c=(a**2+b**2)**0.5
p=a+b+round(c,2)
print('Периметр равен', p)
