#Задача 2.25
print('Найти объем и площадь боковой поверхности параллелепипеда')
a=float(input('Введите длину параллелепипеда:'))
b=float(input('Введите ширину параллелепипеда:'))
c=float(input('Введите высоту параллелепипеда:'))
v=a*b*c
s=2*c*(a+b)
print('Объём параллелепипеда равен', v)
print('Площадь боковой поверхности параллелепипеда равен', s)
