#Задача 2.4
print('Найти периметр квадрата')
a=float(input('Введите длину стороны квадрата:'))
p=4*a
if a<0:
    print('Сторона не может быть отрицательной')
else:
    print('Периметр квадрата равен:', p)
