#Задача 2.5
print('Найти диаметр окружности')
r=float(input('Введите радиус окружности:'))
d=2*r
if r<0:
    print('Радиус не может быть отрицательным')
else:
    print('Диаметр окружности равен:', r)
