#Задача 2.7
print('Найти объем куба и площадь его боковой поверхности')
a=float(input('Введите длину ребра куба:'))
v=a*a*a
s=4*a**2
print('Объем куба равен', v)
print('Площадь боковой поверхности равна', s)
