#Задача 2.9(а и б)
print('Найти значения функций')

x=float(input('Введите значение x:'))
y=float(input('Введите значение y:'))
a=float(input('Введите значение a:'))
b=float(input('Введите значение b:'))

z=2*x**3 - 3.44*x*y + 2.3*x**2 - 7.1*y + 2
x1=3.14*(a+b)**3+2.75*b**2-12.7*a-4.1

print('Значение первой функции:', round(z,2))
print('Значение второй функции:', round(x1,2))
